app/.tests/20260516_130802/jmeter.log
2026-05-16 13:08:13,110 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-16 13:08:13,131 INFO o.a.j.JMeter: Loading user properties from: /opt/jmeter/bin/user.properties
2026-05-16 13:08:13,133 INFO o.a.j.JMeter: Loading system properties from: /opt/jmeter/bin/system.properties
2026-05-16 13:08:13,138 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-16 13:08:13,139 INFO o.a.j.JMeter: Version 5.6.3
2026-05-16 13:08:13,139 INFO o.a.j.JMeter: java.version=21.0.10
2026-05-16 13:08:13,140 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-05-16 13:08:13,140 INFO o.a.j.JMeter: os.name=Linux
2026-05-16 13:08:13,141 INFO o.a.j.JMeter: os.arch=amd64
2026-05-16 13:08:13,142 INFO o.a.j.JMeter: os.version=6.6.87.2-microsoft-standard-WSL2
2026-05-16 13:08:13,144 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-05-16 13:08:13,144 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-16 13:08:13,144 INFO o.a.j.JMeter: Max memory     =1073741824
2026-05-16 13:08:13,145 INFO o.a.j.JMeter: Available Processors =12
2026-05-16 13:08:13,154 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-16 13:08:13,155 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-16 13:08:13,155 INFO o.a.j.JMeter: JMeterHome=/opt/jmeter
2026-05-16 13:08:13,156 INFO o.a.j.JMeter: user.dir  =/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app
2026-05-16 13:08:13,157 INFO o.a.j.JMeter: PWD       =/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app
2026-05-16 13:08:13,158 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: Tabish FullName: Tabish.localdomain
2026-05-16 13:08:13,174 INFO o.a.j.s.FileServer: Default base='/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app'
2026-05-16 13:08:13,176 INFO o.a.j.s.FileServer: Set new base='/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app/./.tests/20260516_130802'
2026-05-16 13:08:13,384 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-16 13:08:13,419 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-16 13:08:13,424 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-16 13:08:13,428 INFO o.a.j.s.SaveService: Loading file: ./.tests/20260516_130802/test.jmx
2026-05-16 13:08:13,478 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 13:08:13,478 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 13:08:13,479 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 13:08:13,479 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 13:08:13,480 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-16 13:08:13,480 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-16 13:08:13,489 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-16 13:08:13,506 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-16 13:08:13,508 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-16 13:08:13,509 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-16 13:08:13,515 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-16 13:08:13,516 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-16 13:08:13,585 INFO o.a.j.JMeter: Running test (1778917093585)
2026-05-16 13:08:13,622 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Users
2026-05-16 13:08:13,623 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Users.
2026-05-16 13:08:13,624 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-16 13:08:13,624 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=5 delayedStart=false
2026-05-16 13:08:13,630 INFO o.a.j.t.JMeterThread: Thread started: Users 1-1
2026-05-16 13:08:13,634 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-16 13:08:13,635 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-16 13:08:13,645 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Tabish
2026-05-16 13:08:13,651 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-16 13:08:13,653 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-16 13:08:13,654 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-16 13:08:13,654 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-16 13:08:13,655 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-16 13:08:13,744 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2026-05-16 13:08:13,751 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2026-05-16 13:08:13,751 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2026-05-16 13:08:14,127 INFO o.a.j.t.JMeterThread: Thread started: Users 1-2
2026-05-16 13:08:14,193 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2026-05-16 13:08:14,199 INFO o.a.j.u.SSLManager: KeyStore created OK
2026-05-16 13:08:14,200 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2026-05-16 13:08:14,626 INFO o.a.j.t.JMeterThread: Thread started: Users 1-3
2026-05-16 13:08:15,126 INFO o.a.j.t.JMeterThread: Thread started: Users 1-4
2026-05-16 13:08:15,510 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-1
2026-05-16 13:08:15,511 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-1
2026-05-16 13:08:15,627 INFO o.a.j.t.JMeterThread: Thread started: Users 1-5
2026-05-16 13:08:15,903 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-2
2026-05-16 13:08:15,904 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-2
2026-05-16 13:08:16,127 INFO o.a.j.t.JMeterThread: Thread started: Users 1-6
2026-05-16 13:08:16,139 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-3
2026-05-16 13:08:16,141 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-3
2026-05-16 13:08:16,627 INFO o.a.j.t.JMeterThread: Thread started: Users 1-7
2026-05-16 13:08:16,727 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-4
2026-05-16 13:08:16,728 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-4
2026-05-16 13:08:17,126 INFO o.a.j.t.JMeterThread: Thread started: Users 1-8
2026-05-16 13:08:17,626 INFO o.a.j.t.JMeterThread: Thread started: Users 1-9
2026-05-16 13:08:17,649 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-6
2026-05-16 13:08:17,651 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-6
2026-05-16 13:08:17,849 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-5
2026-05-16 13:08:17,850 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-5
2026-05-16 13:08:18,127 INFO o.a.j.t.JMeterThread: Thread started: Users 1-10
2026-05-16 13:08:18,870 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-8
2026-05-16 13:08:18,871 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-8
2026-05-16 13:08:18,888 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-7
2026-05-16 13:08:18,890 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-7
2026-05-16 13:08:19,097 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-9
2026-05-16 13:08:19,100 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-9
2026-05-16 13:08:20,919 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-10
2026-05-16 13:08:20,921 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-10
2026-05-16 13:08:20,923 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-05-16 13:08:20,941 INFO o.a.j.r.Summariser: summary =     10 in 00:00:07 =    1.4/s Avg:  1864 Min:  1466 Max:  2785 Err:     0 (0.00%)